Repository: pypi-data/pypi-mirror-356
Catalog: packages/ocdscardinal/ocdscardinal-0.0.7.tar.gz/ocdscardinal-0.0.7/docs/locale/*/LC_MESSAGES/cli/coverage.po
Languages: es

source: The `coverage` command counts the number of times each JSON field is non-empty.
es: El comando `coverage` cuenta el número de veces que cada campo JSON no está vacío.

source: Run the `help` command to read its description, output format and options:
es: Ejecute el comando `help` para leer su descripción, formato de salida y opciones:

source: Demonstration
es: Demonstración

source: Given this line-delimited JSON file:
es: Dado este archivo JSON delimitado por líneas:

source: The `coverage` command outputs:
es: El comando `coverage` da como salida:

source: Caveats
es: Salvedades

source: These edge cases are not expected to be encountered in real data.
es: No se espera encontrar estos casos extremos en los datos reales.

source: If a member name is duplicated, only the last duplicate is considered:
es: Si el nombre de un miembro está duplicado, sólo se tiene en cuenta el último duplicado:

source: If a member name is empty, its path is the same as its parent object's path:
es: Si un nombre de miembro está vacío, su ruta es la misma que la de su objeto de nivel superior:

source: If a member name ends with `[]`, its path can be the same as a matching sibling's path:
es: Si el nombre de un miembro termina en `[]`, su ruta puede ser la misma que la de otro:
