Repository: pypi-data/pypi-mirror-356
Catalog: packages/plone.mls.core/plone.mls.core-0.7.2.tar.gz/plone.mls.core-0.7.2/src/plone/mls/core/locales/*/LC_MESSAGES/plone.mls.core.po
Languages: de, es, fr, it, pt

source: Activate local MLS settings
de: Lokale MLS-Konfiguration aktivieren
es: Activar los ajustes local del MLS
fr: Activer les paramètres locaux de MLS
it: Attiva impostazioni MLS locale
pt: Ativar as Configurações SLM Locais

source: Activate the local MLS configuration.
de: Die Einstellungen für eine lokale MLS-Konfiguration aktivieren.
es: Activar la configuración local del MLS.
fr: Activer la configuration local de MLS
it: Attiva la configurazione del MLS locale.
pt: Ativar as Configurações SLM Locais

source: Agency ID
de: Agentur-ID
es: ID de la Agencia
fr: ID de l'Agence
it: ID Agenzia
pt: Número de Indentificação da Agência

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Elimina
pt: Cancelar

source: Deactivate local MLS settings
de: Lokale MLS-Konfiguration deaktivieren
es: Desactivar los ajustes local del MLS
fr: Désactiver les paramètres locaux de MLS
it: Disattiva impostazioni MLS locale
pt: Desativar as Configurações SLM Locais

source: Deactivate the local MLS configuration.
de: Die Einstellungen für eine lokale MLS-Konfiguration deaktivieren.
es: Desactivar la configuración local del MLS
fr: Désactiver la configuration local de MLS
it: Disattiva la configurazione del MLS locale.
pt: Desativar as Configurações SLM Locais

source: Local MLS Settings
de: Lokale MLS-Konfiguration
es: Configuración Local del MLS
fr: Les paramètres locaux de MLS
it: Impostazioni MLS Locale
pt: Configurações SLM Locais

source: Local MLS settings activated.
de: Lokale MLS-Konfiguration wurde aktiviert.
es: Configuración local del MLS activados.
fr: Paramètres du MLS local activés.
it: Impostazioni MLS locale attivate.
pt: Configurações SLM locais ativado.

source: Local MLS settings deactivated.
de: Lokale MLS-Konfiguration wurde deaktiviert.
es: Configuración local del MLS desactivados.
fr: Paramètres du MLS local désactivés.
it: Impostazioni MLS locale disattivate.
pt: Configurações SLM locais desativado.

source: Local Propertyshelf MLS Settings
de: Lokale MLS-Konfiguration
es: Ajustes Locales para Propertyshelf MLS
fr: Paramètres du MLS local Propertyshelf
it: Impostazioni MLS locale Propertyshelf
pt: Configurações Propertyshelf SLM Locais

source: MLS API Key
de: MLS API-Schlüssel
es: Llave API del MLS
fr: Clé API du MLS
it: Chiave API MLS
pt: Chave API de SLM

source: MLS Base Settings
de: Basis-MLS Einstellungen
es: Configuración Basica del MLS
fr: Les paramètres de base de MLS
it: Impostazioni Base MLS
pt: Base Configurações do SLM

source: MLS URL
es: URL del MLS
fr: URL du MLS
it: URL MLS
pt: SLM URL

source: Manage the local MLS settings.
de: Verwaltung der lokalen MLS-Einstellungen.
es: Administrar la configuración local del MLS.
fr: Gérer les paramètres locaux de MLS
it: Gestisci le impostazioni del MLS locale.
pt: Gerenciar as Configurações SLM Locais

source: Propertyshelf MLS Settings
de: Propertyshelf MLS Konfiguration
es: Configuración del MLS de Propertyshelf
fr: Paramètres de Propertyshelf MLS
it: Impostazioni MLS Propertyshelf
pt: Configurações de SLM do Propertyshelf

source: Save
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
pt: Salvar

source: The local MLS settings don't work with this content type. Add 'IPossibleLocalMLSSettings' to the provided interfaces to enable this feature.
de: Die lokale MLS-Konfiguration konnte für diesen Inhaltstyp nicht aktiviert werden. Fügen Sie 'IPossibleLocalMLSSettings' zu den unterstützten Interfaces hinzu um dieses Feature zu aktivieren.
es: Los ajustes locales del MLS no funcionan con este tipo de contenido. Añadir 'IPossibleLocalMLSSettings' a las interfaces proporcionadas para activar esta función.
fr: Les paramètres du MLS local ne fonctionnent pas avec ce type de contenu. Ajouter 'IPossibleLocalMLSSettings' aux interfaces fournies pour activer cette fonction.
it: Le impostazioni del MLS locale non funzionano con questa tipologia di contenuto. Aggiungere 'IPossibleLocalMLSSettings' alle interfacce fornite per abilitare questa possibilità.
pt: As configurações locais so SLM não funcionão com este tipo de conteúdo. Adicione 'Possiveis Configurações SLM Locais' as interfaces fornecidas para ativar essa característica.

source: This MLS configuration will be used as the default for this Plone site. You can add more MLS configurations by activating the local MLS settings on any content item within the site.
de: Diese MLS-Konfiguration wird standardmäßig für diese Plone Site verwendet. Es können weitere MLS-Konfigurationen hinzugefügt werden, indem für die jeweiligen Inhaltselemente die lokale Konfiguration aktiviert wird.
es: Esta configuración MLS se utilizará como valor predeterminado para este sitio Plone. Puede añadir más conjuntos MLS activando la configuración local del MLS en cualquier tema dentro del sitio.
fr: Cette configuration MLS sera utilisé comme valeur par défaut pour ce site Plone. Vous pouvez ajouter plus de configurations MLS en activant les paramètres du MLS local sur n'importe quel item à même le site.
it: Questa configurazione MLS sarà usata come predefinita per questo sito Plone. E' possibile aggiungere più configurazioni MLS attivando le impostazioni del MLS locale su ogni elemento contenuto nel sito.
pt: Esta configuração SLM será utilizado como padrão para este site Plone. Você pode adicionar mais configurações SLM ativando as configurações locais SLM em qualquer item de conteúdo no site.

source: This MLS configuration will be used for this content item and all possible child elements.
de: Diese MLS-Konfiguration wird hier und in allen möglichen Unterelementen verwendet.
es: Esta configuración MLS será utilizado para este elemento de contenido y todos los posibles elementos secundarios.
fr: Cette configuration MLS sera utilisée pour ce contenu et pour tous les sous éléments possible.
it: Questa configurazione MLS sarà usata per questo elemento del contenuto e per tutti gli elementi derivanti.
pt: Esta configuração SLM será usado para este conteúdo e todos os possíveis elementos filhos.
