Repository: pypi-data/pypi-mirror-356
Catalog: packages/Kerko/kerko-1.3.0.tar.gz/kerko-1.3.0/src/kerko/translations/*/LC_MESSAGES/kerko.po
Languages: pt

source: yes
pt: sim

source: no
pt: não

source: In {}
pt: Em {}

source: Between {} and {}
pt: Entre {} e {}

source: Everywhere
pt: Em toda parte

source: In authors or contributors
pt: Em autores ou colaboradores

source: In titles
pt: Nos títulos

source: In publication years
pt: Nos anos de publicação

source: In all fields
pt: Em todos os campos

source: In documents
pt: Nos documentos

source: Search your keywords in all bibliographic record fields and in the text content of the available documents.
pt: Pesquise as palavras-chave em todos os campos bibliográficos e no conteúdo textual dos documentos disponíveis.

source: Search your keywords in author or contributor names.
pt: Pesquise as palavras-chave nos nomes de autores ou colaboradores.

source: Search your keywords in titles.
pt: Pesquise as palavras-chave nos títulos.

source: Search a specific publication year (you may use the <strong>%(or_op)s</strong> operator with your keywords to find records having different publication years, e.g., <code>2020 %(or_op)s 2021</code>).
pt: Pesquise por um ano de publicação específico (é possível utilizar o operador <strong>%(or_op)s</strong> com as suas palavras-chave para localizar registos em diferentes anos de publicação, por exemplo: <code>2020 %(or_op)s 2021</code>).

source: OR
pt: OU

source: Search your keywords in all bibliographic record fields.
pt: Pesquise as palavras-chave em todos os campos bibliográficos.

source: Search your keywords in the text content of the available documents.
pt: Pesquise as palavras-chave no conteúdo textual dos documentos disponíveis.

source: Topic
pt: Assunto

source: Resource type
pt: Tipo de recurso

source: Publication year
pt: Ano de publicação

source: Unknown
pt: Desconhecido

source: Resource language
pt: Língua do recurso

source: Online resource
pt: Recurso em linha

source: Relevance
pt: Relevância

source: Newest first
pt: Mais recente primeiro

source: Oldest first
pt: Mais antigo primeiro

source: Author A-Z
pt: Autor A-Z

source: Author Z-A
pt: Autor Z-A

source: Title A-Z
pt: Título A-Z

source: Title Z-A
pt: Título Z-A

source: Recommended format for most reference management software
pt: Formato recomendado para a maioria do software de gestão de referências

source: Recommended format for BibTeX-specific software
pt: Formato recomendado para o software específico BibTeX

source: Cites
pt: Cita

source: Cited by
pt: Citado por

source: Related
pt: Relacionados

source: AND
pt: E

source: NOT
pt: NÃO

source: Remove the '{}' search term
pt: Remover o termo de pesquisa '{}'

source: None of your search criteria could be recognized.
pt: Não foi possível reconhecer nenhum dos seus critérios de pesquisa.

source: Reset search
pt: Limpar pesquisa

source: Show more
pt: Mostrar mais

source: Show less
pt: Mostrar menos

source: Search with the '{}' filter
pt: Pesquisar com o filtro '{}'

source: Add the '{}' filter
pt: Adicionar o filtro '{}'

source: Remove the '{}' filter
pt: Apagar o filtro '{}'

source: Expand subfilters
pt: Expandir subfiltros

source: Collapse subfilters
pt: Recolher subfiltros

source: Previous page
pt: Página anterior

source: Next page
pt: Próxima página

source: Page %(page_num)s
pt: Página %(page_num)s

source: Current page
pt: Página atual

source: Last page
pt: Última página

source: Search results pagination
pt: Paginação dos resultados da pesquisa

source: Page %(current)s of %(total)s
pt: Página %(current)s de %(total)s

source: Preferences
pt: Preferências

source: Close preferences
pt: Fechar as preferências

source: "{}" button
pt: botão "{}"

source: Open in Zotero
pt: Abrir no Zotero

source: Show or hide the "{}" button on full bibliographic record pages. This button allows you to open the record in the Zotero application. It might be useful only if you have the Zotero application installed on your device, and if you were granted access to the Zotero library that holds the record.
pt: Mostrar ou ocultar o botão "{}" nas páginas de registos bibliográficos completos. Este botão permite-lhe abrir o registo na aplicação Zotero. Poderá ser útil apenas se tiver a aplicação Zotero instalada no seu dispositivo e se lhe tiver sido concedido acesso à biblioteca Zotero que contém o registo.

source: View on zotero.org
pt: Ver em zotero.org

source: Show or hide the "{}" button on full bibliographic record pages. This button allows you to view the record on zotero.org. It might be useful only if you were granted access to the Zotero library that holds the record.
pt: Mostrar ou ocultar o botão "{}" nas páginas de registos bibliográficos completos. Este botão permite-lhe ver o registo em zotero.org. Poderá ser útil apenas se lhe for concedido acesso à biblioteca do Zotero que contém o registo.

source: Close
pt: Fechar

source: Search within results for...
pt: Pesquisar nos resultados para...

source: Search for...
pt: Pesquisar por...

source: Search in...
pt: Pesquisar em...

source: Search
pt: Pesquisar

source: Help
pt: Ajuda

source: Close Help panel
pt: Fechar o painel de ajuda

source: The search interface is made of three sections: <strong>{}</strong>, <strong>{}</strong>, and <strong>{}</strong>. These are described in detail below.
pt: A interface de pesquisa é composta por três secções: <strong>{}</strong>, <strong>{}</strong>, e <strong>{}</strong>. Estas são descritas em pormenor a seguir.

source: Explore
pt: Explorar

source: Results
pt: Resultados

source: You may start searching either from the <strong>{}</strong> section or from the <strong>{}</strong> section.
pt: Pode começar a procurar na secção <strong>{}</strong> ou na secção <strong>{}</strong>.

source: This section shows your current search criteria and allows you to submit keywords to search in the bibliography.
pt: Esta secção mostra os seus critérios de pesquisa atuais e permite-lhe submeter palavras-chave para pesquisa na bibliografia.

source: Each new submission adds the entered keywords to the list of search criteria.
pt: Cada novo envio adiciona as palavras-chave introduzidas à lista de critérios de pesquisa.

source: To start a new search instead of adding keywords to the current search, use the <strong>{}</strong> button, then enter your new keywords.
pt: Para iniciar uma nova pesquisa em vez de adicionar palavras-chave à pesquisa atual, use o botão <strong>{}</strong> e depois introduza as suas novas palavras-chave.

source: To replace an already submitted keyword, first remove it by unchecking its checkbox, then submit a new keyword.
pt: Para substituir uma palavra-chave já submetida, primeiro remova-a, desmarcando a caixa de verificação dela, e depois submeta uma nova palavra-chave.

source: You may control the extent of your search by selecting where to search. The options are:
pt: Você pode controlar a extensão de sua pesquisa selecionando onde pesquisar. As opções são:

source: You may use boolean operators with your keywords. For instance:
pt: Pode utilizar operadores booleanos com as suas palavras-chave. Por exemplo:

source: <strong>{and_op}</strong>: Finds entries that contain all specified terms. This is the default relation between terms when no operator is specified, e.g., <code>a b</code> is the same as <code>a {and_op} b</code>.
pt: <strong>{and_op}</strong>: Encontra entradas que contêm todos os termos especificados. Esta é a relação padrão entre termos quando nenhum operador é especificado, por exemplo: <code>a b</code> é o mesmo que <code>a {and_op} b</code>.

source: <strong>{or_op}</strong>: Finds entries that contain any of the specified terms, e.g., <code>a {or_op} b</code>.
pt: <strong>{or_op}</strong>: Encontra entradas que contenham qualquer um dos termos especificados, por exemplo: code>a {or_op} b</code>.

source: <strong>{not_op}</strong>: Excludes entries that contain the specified terms, e.g., <code>{not_op} a</code>.
pt: <strong>{not_op}</strong>: Exclui entradas que contenham os termos especificados, por exemplo: <code>{not_op} a</code>.

source: Boolean operators must be entered in UPPERCASE.
pt: Os operadores booleanos devem ser inscritos em MAIÚSCULAS.

source: You may use logical groupings (with parentheses) to eliminate ambiguities when using multiple boolean operators, e.g., <code>(a {or_op} b) {and_op} c</code>.
pt: Pode utilizar agrupamentos lógicos (com parênteses) para eliminar ambiguidades ao utilizar múltiplos operadores booleanos, por exemplo: <code>(a {or_op} b) {and_op} c</code>.

source: You may require exact sequences of words (with double quotes), e.g., <code>"a b c"</code>. The default difference between word positions is 1, meaning that an entry will match if it contains the words next to each other, but a different maximum distance may be specified (with the tilde character), e.g., <code>"web search"~2</code> allows up to 1 word between <code>web</code> and <code>search</code>, meaning it could match <code>web site search</code> as well as <code>web search</code>.
pt: Pode necessitar de sequências exatas de palavras (com aspas duplas), por exemplo, <code>"a b c"</code>. A diferença por defeito entre as posições das palavras é 1, o que significa que uma entrada irá corresponder se contiver as palavras uma ao lado da outra, mas uma distância máxima diferente pode ser especificada (com o carácter de til), por exemplo: code>"pesquisa web"~2</code> permite até 1 palavra entre <code>pesquisa</code> e <code>web</code>, o que significa que pode corresponder tanto <code> pesquisa site web</code> como <code> pesquisa web</code>.

source: You may specify that some words are more important than others (with the caret), e.g., <code>faceted^2 search browsing^0.5</code> specifies that <code>faceted</code> is twice as important as <code>search</code> when computing the relevance score of the results, while <code>browsing</code> is half as important. Such term boosting may be applied to a logical grouping, e.g., <code>(a b)^3 c</code>.
pt: Pode especificar que algumas palavras são mais importantes do que outras (com o acento circunflexo), por exemplo: <code>faceted^2 search browsing^0.5</code> especifica que <code> faceted</code> é duas vezes mais importante que <code>search</code> ao calcular a pontuação de relevância dos resultados, enquanto <code>browsing</code> tem metade da importância. Tal reforço de termo pode ser aplicado a um agrupamento lógico, por exemplo: <code>(a b)^3 c</code>.

source: Keyword search is case-insentitive, accents are folded, and punctuation is ignored.
pt: A pesquisa por palavra-chave não diferencia maiúsculas de minúsculas, e os acentos e a pontuação são ignorados.

source: Stemming is performed on terms from most text fields, e.g., title, abstract, notes. Words are thus reduced to their root form, saving you from having to specify all variants of a word when searching, e.g., terms such as <code>search</code>, <code>searches</code>, and <code>searching</code> all produce the same results. Stemming is <em>not</em> applied to text in name fields, e.g., authors/contributors, publisher, publication.
pt: A derivação é realizada em termos da maioria dos campos de texto, por exemplo: título, resumo, notas. As palavras são assim reduzidas à sua forma raiz, poupando-lhe de ter de especificar todas as variantes de uma palavra ao pesquisar, por exemplo, termos como <code>search</code>, <code>searches</code> e <code>searching</code> todos produzem os mesmos resultados. A derivação <em>não</em> é aplicada ao texto nos campos do nome, por exemplo, autores/contribuidores, editor, publicação.

source: This section allows you to explore categories associated with the references.
pt: Esta secção permite explorar categorias associadas às referências.

source: Categories can be used to filter your search. Check a category to add it to your search criteria and narrow your search. Your search results will then only show entries that are associated with that category.
pt: As categorias podem ser usadas para filtrar sua pesquisa. Verifique uma categoria para adicioná-la aos seus critérios de pesquisa e restringir sua pesquisa. Os resultados da pesquisa mostrarão apenas as entradas associadas a essa categoria.

source: Uncheck a category to remove it from your search criteria and broaden your search results.
pt: Desmarque uma categoria para a remover dos seus critérios de pesquisa e alargar os seus resultados de pesquisa.

source: The numbers shown next to the categories indicate how many entries are associated with each category in the current set of results. Those numbers will vary based on your search criteria to always describe the current set of results. Likewise, categories and whole facets will disappear when the result set has no entry associated to them.
pt: Os números apresentados ao lado das categorias indicam quantas entradas estão associadas a cada categoria no atual conjunto de resultados. Esses números variarão com base nos seus critérios de pesquisa para descrever sempre o que está no atual conjunto de resultados. Da mesma forma, categorias e facetas inteiras desaparecerão quando o conjunto de resultados não tiver nenhuma entrada associada a elas.

source: An arrow icon ({}) appearing next to a category indicates that subcategories are available. You may press it to expand a list of more specific categories. You may press it again later to collapse the list. Expanding or collapsing subcategories will not change your current search; this allows you to quickly explore a hierarchy of categories if desired.
pt: Um ícone de seta ({}) que aparece ao lado de uma categoria indica que as subcategorias estão disponíveis. Você pode pressioná-lo para expandir uma lista de categorias mais específicas. Você pode pressioná-lo novamente mais tarde para recolher a lista. Expandir ou recolher subcategorias não alterará sua pesquisa atual; isso permite que você explore rapidamente uma hierarquia de categorias, se desejar.

source: This section shows the search results. When no search criteria has been given, it shows the full content of the bibliography (up to {page_len} entries per page).
pt: Esta secção mostra os resultados da pesquisa. Quando não foi dado qualquer critério de pesquisa, mostra o conteúdo completo da bibliografia (até {page_len} entradas por página).

source: Each entry of the results list is a link to its full bibliographic record. From the bibliographic record view, you may continue exploring the search results by going to previous or following records in your search results, or you may return to the list of results.
pt: Cada entrada da lista de resultados é uma ligação para o seu registo bibliográfico completo. A partir da vista do registo bibliográfico, pode continuar a explorar os resultados da pesquisa indo a registos anteriores ou seguintes nos seus resultados de pesquisa, ou pode voltar à lista de resultados.

source: Additional links, such as <strong>Read document</strong> or <strong>View on <em>[website name]</em></strong>, may appear under a result. These give you quick access to the resource. Those links will also be available in the full bibliographic record.
pt: Links adicionais, como <strong>Ler documento</strong> ou <strong>Ver em <em>[nome do site]</em></strong>, podem aparecer abaixo em um resultado. Eles fornecem um acesso rápido ao recurso. Esses links também estarão disponíveis na entrada bibliográfica completa.

source: The <strong>Abstracts</strong> button lets you toggle the display of abstracts within the list of search results. Enabling abstracts, however, will have no effect on results for which no abstract is available.
pt: O botão <strong>Resumos</strong> permite alternar a exibição de resumos na lista de resultados da pesquisa. A habilitação de resumos, no entanto, não afetará os resultados para os quais nenhum resumo esteja disponível.

source: Various options are provided to let you sort the search results. One of them is the <strong>Relevance</strong> option, which ranks the results from most relevant to least relevant. The score used for ranking takes into account word frequencies as well as the fields where they appear. For instance, if a search term occurs frequently in an entry or is one of very few terms used in that entry, that entry will probably rank higher than another where the search term occurs less frequently or where lots of other words also occur. Likewise, a search term will have more effect on the scores if it is rare in the whole bibliography than if it is very common. Also, if a search term appears in, e.g., the title of an entry, it will have more effect on the score of that entry than if it appeared in a less important field such as the abstract.
pt: São fornecidas várias opções para lhe permitir ordenar os resultados da pesquisa. Uma delas é a opção <strong>Relevância</strong>, que classifica os resultados do mais relevante para o menos. A pontuação utilizada para a classificação tem em conta as frequências das palavras, bem como os campos onde elas aparecem. Por exemplo, se um termo de pesquisa ocorre frequentemente numa entrada ou é um dos muito poucos termos utilizados nessa entrada, essa entrada será provavelmente mais relevante do que outra em que o termo de pesquisa ocorre com menos frequência ou em que muitas outras palavras também ocorrem. Da mesma forma, um termo de pesquisa terá mais efeito nas classificações se for raro em toda a bibliografia do que se for muito comum. Além disso, se um termo de pesquisa aparecer, por exemplo, no título de uma entrada, terá mais efeito na classificação dessa entrada do que se aparecer num campo menos importante, como o resumo.

source: The <strong>Relevance</strong> sort is only available after keywords have been submitted using the <strong>{search}</strong> section.
pt: A classificação <strong>Relevância</strong> só está disponível após o envio das palavras-chave usando a secção <strong>{search}</strong>.

source: Categories selected in the <strong>{explore}</strong> section have no effect on the relevance score. Their only effect is to filter the list of results.
pt: As categorias selecionadas na secção <strong>{explore}</strong> não têm efeito na pontuação de relevância. O seu único efeito é filtrar a lista de resultados.

source: View details
pt: Ver detalhes

source: Read documents
pt: Ler documentos

source: Read '{}'
pt: Ler '{}'

source: Read document
pt: Ler o documento

source: View on {}
pt: Ver em {}

source: Sort by {sort_option}
pt: Ordenar por {sort_option}

source: Current sort
pt: Critério atual de ordenação

source: Sort by...
pt: Ordenar por...

source: Sort by: {sort_option}
pt: Ordenar por: {sort_option}

source: Permanent link to this bibliographic record
pt: Ligação permanente para este recurso bibliográfico

source: Print this record
pt: Imprimir este recurso

source: Download this record
pt: Descarregar este recurso

source: Download in {download_option} format
pt: Descarregar em formato {download_option}

source: Search the '{}' resource type
pt: Pesquisar o tipo de recurso '{}'

source: Author/contributor
pt: Autor ou contribuidor

source: Search '{}'
pt: Pesquisar '{}'

source: Link
pt: Ligação

source: Notes
pt: Notas

source: Citation
pt: Citação

source: Document
pt: Documento

source: Link to this record
pt: Ligação para este recurso

source: Relations
pt: Relações

source: Processing time: %(time)s seconds
pt: Tempo de processamento: %(time)s segundos

source: Full bibliography
pt: Bibliografia completa

source: Toggle navigation
pt: Alternar navegação

source: Remove this message
pt: Eliminar esta mensagem

source: Powered by {zotero} and {kerko}.
pt: Impulsionado por {zotero} e {kerko}.

source: Your search
pt: A sua pesquisa

source: Return to list of results
pt: Voltar para a lista de resultados

source: Hide abstracts
pt: Ocultar os resumos

source: Show abstracts
pt: Exibir os resumos

source: %(count_formatted)s resource
pt: %(count_formatted)s recurso

source: Abstracts
pt: Resumos

source: Print this citation
pt: Imprimir esta citação

source: Last update from database: %(when)s
pt: Última atualização da base de dados: %(when)s

source: Suggestions:
pt: Sugestões:

source: Make sure that all words are spelled correctly.
pt: Certifique-se de que todas as palavras foram digitadas corretamente.

source: Try different words.
pt: Experimente palavras diferentes.

source: Try more general terms.
pt: Experimente termos mais gerais.

source: Close Explore panel
pt: Fechar o painel de exploração

source: Custom feed
pt: Feed personalizado

source: Main feed
pt: Feed principal

source: The document you have requested has been removed. Please check below for the latest documents available.
pt: O documento que solicitou foi retirado. Consulte abaixo os últimos documentos disponíveis.

source: Your search did not match any resources
pt: A sua pesquisa não retornou resultados

source: Result
pt: Resultado

source: Custom feed based on your search
pt: Feed personalizado com base na sua pesquisa
