Repository: pypi-data/pypi-mirror-356
Catalog: packages/yt-dl-cli/yt_dl_cli-1.0.3.tar.gz/yt_dl_cli-1.0.3/src/yt_dl_cli/locales/*/LC_MESSAGES/messages.po
Languages: de

source: max_workers must be at least 1, got {workers}
de: max_workers muss mindestens 1 sein, erhalten: {workers}

source: quality must be one of: {valid}, got {quality}
de: quality muss einer der folgenden Werte sein: {valid}, erhalten: {quality}

source: [SKIP] Already exists: {title}
de: [ÜBERSPRUNG] Bereits vorhanden: {title}

source: [START] {title}
de: [BEGINN] {title}

source: [DONE] {title}
de: [FERTIG] {title}

source: Error closing resource: {error}
de: Fehler beim Schließen der Ressource: {error}

source: Failed to extract info for {url}: {error}
de: Fehler beim Extrahieren der Informationen für {url}: {error}

source: Unable to extract video info
de: Video-Informationen konnten nicht extrahiert werden

source: Download failed for {url}: {error}
de: Download für {url} fehlgeschlagen: {error}

source: DOWNLOAD SUMMARY:
de: DOWNLOAD-ZUSAMMENFASSUNG:

source: Processed: {total}
de: Verarbeitet: {total}

source: Successful: {success}
de: Erfolgreich: {success}

source: Skipped: {skipped}
de: Übersprungen: {skipped}

source: Failed: {failed}
de: Fehlgeschlagen: {failed}

source: Elapsed time: {elapsed:.2f}s
de: Verstrichene Zeit: {elapsed:.2f}s

source: No URLs to download.
de: Keine URLs zum Herunterladen.

source: Starting download of {count} items with {workers} workers
de: Starte Download von {count} Elementen mit {workers} Threads

source: Error: file '{file}' not found
de: Fehler: Datei '{file}' nicht gefunden

source: Error reading '{file}': {error}
de: Fehler beim Lesen von '{file}': {error}

source: Download interrupted by user.
de: Download durch Benutzer unterbrochen.

source: Critical error: {error}
de: Kritischer Fehler: {error}
