Repository: pypi-data/pypi-mirror-356
Catalog: packages/SALTISE-course-flow/saltise_course_flow-0.8.33.tar.gz/saltise_course_flow-0.8.33/course_flow/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Course Title
fr: Titre du cours

source: Ponderation Theory/Practical/Individual
fr: Pondération Théorie/Pratique/Individuel

source: Course Description
fr: Description du cours

source: Course Code
fr: Code de cours

source: Hours
fr: Heures

source: Time
fr: Temps

source: Ministerial Competencies
fr: Compétences ministérielles

source: Competency
fr: Compétence

source: Title
fr: Titre

source: Term
fr: Session

source: Prerequisites
fr: Prérequis

source: Required For
fr: Requis pour

source: Course Outcome
fr: Acquis de cours

source: Sub-Outcomes
fr: Sous-acquis

source: Competencies
fr: Compétences

source: Specific Education
fr: Éducation specifique

source: General Education
fr: Éducation générale

source: Total Hours
fr: Heures totale

source: Theory
fr: Théorie

source: Practical
fr: Pratique

source: Credits
fr: Crédits

source: Competency Code
fr: Code de Compétence

source: Individual
fr: Individuel

source: Project
fr: Projet

source: Projects
fr: Projets

source: Workflow-Project Link
fr: Lien entre Projet et Plan de Travaille

source: Workflow-Project Links
fr: Liens entre Projet et Plan de Travaille

source: Outcome-Workflow Link
fr: Lien entre Acquis et Plan de Travaille

source: Outcome-Workflow Links
fr: Liens entre Acquis et Plan de Travaille

source: Custom Activity Column
fr: Colonne d'activité personnalisée

source: Out of Class (Instructor)
fr: Hors classe (instructeur)

source: Out of Class (Students)
fr: Hors classe (étudiants)

source: In Class (Instructor)
fr: En classe (instructeur)

source: In Class (Students)
fr: En classe (étudiants)

source: Custom Course Column
fr: Colonne de cours personnalisée

source: Preparation
fr: Préparation

source: Lesson
fr: Leçons

source: Artifact
fr: Artefacts

source: Assessment
fr: Évaluations

source: Custom Program Category
fr: Catégorie de cours

source: Column
fr: Colonne

source: Columns
fr: Colonnes

source: Node Link
fr: Lien entre noeuds

source: Node Links
fr: Liens entre noeuds

source: Outcome
fr: Acquis

source: Outcomes
fr: Acquis

source: Outcome-Outcome Link
fr: Lien entre acquis

source: Outcome-Outcome Links
fr: Liens entre acquis

source: None
fr: Vide

source: Individual Work
fr: Travail individuel

source: Work in Groups
fr: Travail en groupe

source: Whole Class
fr: Classe

source: Formative
fr: Formatif

source: Summative
fr: Sommatif

source: Comprehensive
fr: De synthèse

source: Gather Information
fr: Collecter des informations

source: Discuss
fr: Discuter

source: Problem Solve
fr: Résolution de problèmes

source: Analyze
fr: Analyser

source: Assess/Review Peers
fr: Évaluation des pairs

source: Debate
fr: Débat

source: Game/Roleplay
fr: Jeu/Jeu de rôle

source: Create/Design
fr: Créer/Concevoir

source: Revise/Improve
fr: Réviser/Améliorer

source: Read
fr: Lire

source: Write
fr: Écrire

source: Present
fr: Présenter

source: Experiment/Inquiry
fr: Expérience/Enquête

source: Instructor Resource Curation
fr: Sélection des ressources (instructeur)

source: Instructor Orchestration
fr: Orchestration (instructeur)

source: Instructor Evaluation
fr: Évaluation (instructeur)

source: Other
fr: Autre

source: Jigsaw
fr: Stratégie croisée

source: Peer Instruction
fr: Enseignement par les pairs

source: Case Studies
fr: Étude de cas

source: Gallery Walk
fr: Atelier-carrousel

source: Reflective Writing
fr: Écriture réflexive

source: Two-Stage Exam
fr: Test en deux étapes

source: Toolkit
fr: Boîte à outils

source: One Minute Paper
fr: Rédaction-minute

source: Distributed Problem Solving
fr: Résolution distribuée de problèmes

source: Peer Assessment
fr: Évaluation par les pairs

source: Activity Node
fr: Noeud d'activité

source: Course Node
fr: Noeud de cours

source: Program Node
fr: Noeud de programme

source: seconds
fr: secondes

source: hours
fr: heures

source: days
fr: jours

source: weeks
fr: semaines

source: months
fr: mois

source: yrs
fr: années

source: credits
fr: crédits

source: Node
fr: Noeud

source: Nodes
fr: Noeuds

source: Outcome-Node Link
fr: Lien entre acquis et noeud

source: Outcome-Node Links
fr: Liens entre acquis et noeud

source: Part
fr: Partie

source: Week
fr: Semaine

source: Weeks
fr: Semaines

source: Node-Week Link
fr: Lien entre noeud et semaine

source: Node-Week Links
fr: Liens entre noeud et semaine

source: Advanced
fr: Avancés

source: Category
fr: Catégorie

source: Task
fr: Tâche

source: Context
fr: Contexte

source: Workflow
fr: Plan de travail

source: Workflows
fr: Plans de travail

source: Activity
fr: Activité

source: Activities
fr: Activités

source: Course
fr: Cours

source: Courses
fr: Cours

source: Program
fr: Programme

source: Programs
fr: Programmes

source: Column-Workflow Link
fr: Lien entre colonne et plan de travail

source: Column-Workflow Links
fr: Liens entre colonne et plan de travail

source: Week-Workflow Link
fr: Lien entre semaine et plan de travail

source: Week-Workflow Links
fr: Lien entre semaines et plan de travail

source: Discipline name
fr: Nom de la discipline

source: Enter the name of a new discipline.
fr: Saisissez le nom d'une nouvelle discipline.

source: View
fr: Vue

source: Edit
fr: Modifier

source: Comment
fr: Commenter

source: Student
fr: Étudiant

source: Instructor
fr: Instructeur

source: Shared
fr: Partagé

source: a CourseFlow user
fr: un utilisateur

source: Untitled
fr: Sans-titre

source: New Activity
fr: Nouvelle activité

source: Create an activity:
fr: Créer une activité:

source: Home
fr: Accueil

source: My library
fr: Ma bibliothèque

source: Explore
fr: Explorer

source: My classrooms
fr: Mes classes

source: My favourites
fr: Mes favoris

source: See all
fr: Voir tout

source: Import from old CourseFlow
fr: Importer de l'ancien CourseFlow

source: Help and support
fr: Aide

source: Profile
fr: Profil

source: Reset my password
fr: Réinitialiser mon mot de passe

source: Notification settings
fr: Paramètres de notification

source: Sign out
fr: Se déconnecter

source: Hi there! Would you like to receive emails about updates to CourseFlow? You can always change your mind by viewing your profile.
fr: Bonjour! Souhaitez-vous recevoir des e-mails sur les mises à jour de CourseFlow? Vous pouvez toujours changer d'avis en consultant votre profil.

source: Your device is not supported. Please use a laptop or desktop for the best experience.
fr: Votre appareil n'est pas compatible. Veuillez utiliser un ordinateur portable ou de bureau pour une meilleure expérience

source: Project Comparison
fr: Comparaison de projets

source: Add
fr: Ajouter

source: View Options
fr: Options de vue

source: Restore Deleted
fr: Restaurer supprimé

source: New Course
fr: Nouveau cours

source: Create a course:
fr: Créer un cours:

source: Edit User
fr: Modifier l'utilisateur

source: My Favourites
fr: Mes favoris

source: Import
fr: Importer

source: My Library
fr: Ma bibliothèque

source: New Classroom
fr: Nouvelle classe

source: Create a live project.
fr: Créer une classe.

source: My Classrooms
fr: Mes classes

source: My Projects
fr: Mes projets

source: Shared With Me
fr: Partagé avec moi

source: My Strategies
fr: Mes stratégies

source: first
fr: premiere

source: previous
fr: précédente

source: next
fr: prochaine

source: last
fr: dernière

source: New Outcome
fr: Nouveau acquis

source: Create an outcome.
fr: Créer un acquis.

source: New Program
fr: Nouveau programme

source: Create a program:
fr: Créer un programme:

source: New Project
fr: Nouveau projet

source: Create a project.
fr: Créer un projet.

source: SALTISE Administration
fr: Administration SALTISE

source: Manage update notifications
fr: Gérer les notifications de mise à jour

source: CourseFlow Analytics
fr: Données CourseFlow

source: SALTISE Analytics
fr: Analytique SALTISE

source: Overview
fr: Aperçu

source: User Info
fr: Information de utilisateur

source: Notifications List
fr: Notifications

source: Analytics on CourseFlow usage
fr: Donnée d'utilisation de CourseFlow

source: Workflow Information:
fr: Informations sur les plans:

source: User Information:
fr: Informations sur les utilisateurs:

source: User Details:
fr: Détails de l'utilisateur:

source: Users who have subscribed to notifications:
fr: Utilisateurs abonnés aux notifications:

source: Add new
fr: Ajouter

source: Projects are used to organize your Programs, Courses, and Activities. Projects you create will be shown here. Click the button above to create a or import a project to get started.
fr: Les projets sont utilisés pour organiser vos programmes, cours et activités. Les projets que vous créez seront affichés ici. Cliquez sur le bouton ci-dessus pour en créer un ou importez un projet pour commencer.

source: Projects I've Been Added To
fr: Projets auxquels j'ai été ajouté

source: Projects shared with you by others (for which you have either view or edit permissions) will appear here.
fr: Les projets partagés avec vous par d'autres utilisateurs apparaîtront ici si vous disposez des autorisations d'affichage ou de modification.

source: Restore Projects
fr: Restaurer un projet

source: Projects you have deleted can be restored from here.
fr: Les projets que vous avez supprimés peuvent être restaurés à partir d'ici.

source: Shared Projects
fr: Projets partagés

source: Shared Programs
fr: Programmes partagés

source: Programs shared with you by others (for which you have either view or edit permissions) will appear here.
fr: Les programmes partagés avec vous par d'autres utilisateurs apparaîtront ici si vous disposez des autorisations d'affichage ou de modification.

source: Shared Courses
fr: Cours partagés

source: Courses shared with you by others (for which you have either view or edit permissions) will appear here.
fr: Les cours partagés avec vous par d'autres utilisateurs apparaîtront ici si vous disposez des autorisations d'affichage ou de modification.

source: Shared Activities
fr: Activités partagés

source: Activities shared with you by others (for which you have either view or edit permissions) will appear here.
fr: Les activités partagées avec vous par d'autres utilisateurs apparaîtront ici si vous disposezdes autorisations d'affichage ou de modification.

source: My Activity Templates
fr: Mes modèles d'activité

source: Activity templates, also known as Strategies, are reusable sections of activities you can drag and drop into your workflows. Click Add New above to get started.
fr: Les modèles d'activité, également appelés stratégies, sont des sections d'activités réutilisables que vous pouvez faire glisser et déposer dans vos plan de travail. Cliquez sur Ajouter un nouveau ci-dessus pour commencer.

source: My Course Templates
fr: Mes modèles de cours

source: Course templates are reusable sections of courses you can drag and drop into your workflows. Click Add New above to get started.
fr: Les modèles de cours sont des sections de cours réutilisables que vous pouvez faire glisser et déposer dans vos plan de travail. Cliquez sur Ajouter un nouveau ci-dessus pour commencer.

source: Templates I've Been Added To
fr: Modèles auxquels j'ai été ajouté

source: Templates shared with you by others (for which you have either view or edit permissions) will appear here.
fr: Les modèles partagés avec vous par d'autres (pour lesquels vous disposez d'autorisations d'affichage ou de modification) apparaîtront ici.

source: Restore deleted
fr: Restaurer supprimé(e)

source: All Workflows
fr: Plans de travail

source: Workflows are the basic content object of CourseFlow, representing either a Program, Course, or Activity. Workflows you add to this project will be shown here. Click the button above to create a or import a workflow to get started.
fr: Les plans de travail sont l'objet de contenu de base de CourseFlow, représentant soit un programme, un cours ou une activité. Les plasn de travail que vous ajoutez à ce projet seront affichés ici. Cliquez sur le bouton ci-dessus pour créer ou importer un plan de travail.

source: Activities can be used to plan a single lesson/assessment, or multiple linked lessons/assessments. Click the button above to create or import an activity.
fr: Les activités peuvent être utilisées pour planifier une seule leçon/évaluation ou plusieurs leçons/évaluations liées. Cliquez sur le bouton ci-dessus pour créer ou importer une activité.

source: Courses can be used to plan a course and its related learning outcomes. Click the button above to create or import a course.
fr: Les cours peuvent être utilisés pour planifier un cours et ses acquis d'apprentissage associés. Cliquez sur le bouton ci-dessus pour créer ou importer un cours.

source: Programs can be used to plan a curriculum and its related learning outcomes. Click the button above to create or import a program.
fr: Les programmes peuvent être utilisés pour planifier un programme d'études et les acquis d'apprentissage qui s'y rapportent. Cliquez sur le bouton ci-dessus pour créer ou importer un programme.

source: Deleted workflows can be restored here
fr: Les plans de travail supprimés peuvent être restaurer ici.

source: This Project
fr: Ce projet

source: There are no applicable workflows in this project.
fr: Il n'y a pas de plans de travails applicables dans ce projet.

source: Owned By You
fr: Vos créations

source: You do not own any projects. Create a project first.
fr: Vous ne possédez aucun projet. Créez d'abord un projet.

source: Your Favourites
fr: Vos favoris

source: You have no relevant favourites. Use the Explore menu to find and favourite content by other users.
fr: Vous n'avez pas de favoris pertinents. Utilisez le menu Explorer pour rechercher et mettre en favori le contenu d'autres utilisateurs.

source: Your CourseFlow Export
fr: Votre export

source: Hi there! Here are the results of your recent export.
fr: Bonjour! Voici les résultats de votre dernière exportation.

source: (copy)
fr: (copie)

source: User is not a teacher.
fr: L'utilisateur n'est pas un instructeur.

source: This user's role cannot be changed.
fr: Le rôle de cet utilisateur ne peut pas être modifié.

source: My classrooms (teacher)
fr: Mes classes (instructeur)

source: You haven't created any classrooms yet. Create a project, then choose 'Create Classroom' to create a live classroom.
fr: Vous n'avez pas encore créé de classes. Créez un projet, puis choisissez 'créer une classe' pour créer une classe.

source: My classrooms (student)
fr: Mes classes (étudiant)

source: You aren't registered for any classrooms right now.
fr: Vous n'êtes inscrit à aucune classe pour le moment.

source: This user has a student account, and cannot be made a teacher.
fr: Cet utilisateur a un compte étudiant et ne peut pas être nommé instructeur.

source: Someone
fr: Quelqu'un

source: added you to the
fr: vous a ajouté au

source: notified you in a comment in
fr: vous a averti dans un commentaire

source: notified you for
fr: vous a averti pour
