Repository: pypi-data/pypi-mirror-356
Catalog: packages/djangoldp-branding/djangoldp_branding-2.0.2.tar.gz/djangoldp_branding-2.0.2/djangoldp_branding/locale/*/LC_MESSAGES/django.po
Languages: es

source: requested access to your space:
es: solicitó el acceso a su espacio:

source: Accéder à l'application
es: Acceso a la aplicación

source: Pour ne plus recevoir ces e-mails, rends-toi sur
es: Para dejar de recibir estos correos electrónicos, vaya a

source: ton profile
es: su perfil

source: Your request to access the space
es: Su solicitud de acceso al espacio

source: has been
es: ha sido

source: accepted
es: aceptado

source: denied
es: denegado

source: Welcome,
es: Bienvenido,

source: administrator of
es: administrador de

source: View site
es: Ver el sitio

source: Documentation
es: Documento

source: Change password
es: Cambiar la contraseña

source: Log out
es: Cerrar sesión

source: Home
es: Portada

source: Se connecter
es: Iniciar sesión

source: You are authenticated as %(username)s, but are not authorized to access this page. Would you like to login to a different account?
es: Está autentificado como %(username)s, pero no está autorizado a acceder a esta página. ¿Desea iniciar sesión con una cuenta diferente?

source: Nom d'utilisateur ou e-mail:
es: Nombre de usuario o email:

source: Please correct the error below.
es: Por favor, corrija el error que aparece a continuación.

source: Please correct the errors below.
es: Por favor, corrija los errores que aparecen a continuación.

source: Mot de passe oublié ?
es: ¿Has olvidado la contraseña?

source: Ne réponds pas directement à cet e-mail, à la place rends-toi sur
es: No responda directamente a este correo electrónico, sino que vaya a

source: Activation terminée
es: Activación completada

source: Merci, l'activation est terminée
es: Gracias, la activación está completa

source: Echec de l'activation
es: Activación fallida

source: Échec de l'activation de l'utilisateur
es: Fallo en la activación del usuario

source: Contacte ton administrateur pour plus d'informations
es: Póngase en contacto con su administrador para obtener más información

source: Inscription terminée
es: Inscripción completada

source: L'inscription est fermée pour ce site.
es: El registro está cerrado para este sitio.

source: E-mail d'activation envoyé
es: Envío del correo electrónico de activación

source: Un e-mail d'activation t'a été envoyé
es: Se le ha enviado un correo electrónico de activación

source: Enregistrer un compte
es: Registrar una cuenta

source: Nom d'utilisateur:
es: Nombre de usuario:

source: E-mail:
es: Correo electrónico

source: Envoyer un e-mail d'activation
es: Su dirección de correo electrónico no es válida.

source: Retour
es: Volver

source: Demande d'accès aux informations
es: Solicitud de acceso a la información

source: Demande d'autorisation
es: Solicitud de autorización

source: L'application
es: La aplicación

source: demande à accéder à ces informations te concernant :
es: solicitar el acceso a su información:

source: demande à accéder à ton compte.
es: solicitar el acceso a su cuenta.

source: Continuer
es: Continuar

source: Changer de compte
es: Cambiar de cuenta

source: Un compte a été créé pour toi sur
es: Se ha creado una cuenta para usted en

source: Crée mon mot de passe
es: Crea mi contraseña

source: Échec de l'activation du compte
es: No se ha podido activar la cuenta

source: Ton compte est maintenant activé
es: Su cuenta está activada

source: Déconnecté
es: Desconectado

source: Ton compte n'a pas accès à cette page. Pour continuer, connecte-toi avec un compte qui y a accès.
es: Su cuenta no tiene acceso a esta página. Para continuar, conéctese con una cuenta que sí tenga acceso.

source: Se connecter avec un autre fournisseur d'identité
es: Conexión con otro proveedor de identidad

source: Tu n'as pas encore de compte ?
es: ¿Aún no tienes una cuenta?

source: S'inscrire
es: Inscríbete

source: Perdu
es: Perdido

source: Désolé, nous n'avons pas trouvé de page où te rediriger. Navigue manuellement vers ton application préférée.
es: Lo sentimos, no hemos podido encontrar una página a la que redirigirte. Por favor, navegue manualmente a su aplicación favorita.

source: Si tu n'es pas sûr, contacte un administrateur système.
es: Si no está seguro, póngase en contacto con un administrador del sistema.

source: Mot de passe modifié
es: Contraseña cambiada

source: Changer de mot de passe
es: Cambiar contraseña

source: Les mots de passe ne correspondent pas.
es: Las contraseñas no coinciden.

source: Envoyer
es: Enviar

source: Mot de passe réinitialisé avec succès
es: Contraseña restablecida con éxito

source: Lien invalide
es: Enlace no válido

source: E-mail envoyé
es: Correo electrónico enviado

source: Vérifie ta boite mail.
es: Comprueba tu buzón.

source: Nous t'avons envoyé des instructions pour définir ton mot de passe.
es: Le hemos enviado instrucciones para establecer su contraseña.

source: You're receiving this email because you requested a new password for your user account at
es: Está recibiendo este correo electrónico porque ha solicitado una nueva contraseña para su cuenta de usuario en

source: Please go to the following page and choose a new password:
es: Por favor, vaya a la siguiente página y elija una nueva contraseña:

source: Your username, in case you've forgotten:
es: Tu nombre de usuario, en caso de que lo hayas olvidado:

source: Envoyer les instructions
es: Enviar instrucciones

source: Les inscriptions sont actuellement fermées
es: Las inscripciones están cerradas

source: Tu es désormais enregistré
es: Ya está registrado

source: Tu es désormais enregistré. Un e-mail d'activation t'a été envoyé
es: Ya está registrado. Se le ha enviado un correo electrónico de activación

source: Templates registry
es: Registro de plantillas

source: When two templates share the same name, the first to appear on this list will be the one used
es: Cuando dos plantillas comparten el mismo nombre, la primera que aparezca en esta lista será la utilizada

source: MANAGED
es: GESTIONADO

source: EXIST
es: EXISTE

source: but
es: pero

source: UNMANAGED
es: NO GESTIONADO
