Repository: pypi-data/pypi-mirror-356
Catalog: packages/yt-dl-cli/yt_dl_cli-1.0.4-py3-none-any.whl/yt_dl_cli/locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: max_workers must be at least 1, got {workers}
ru: Максимальное число потоков должно быть не менее 1, получил {workers}
uk: Максимальне число потоків має бути не меньш 1, отримав {workers}

source: quality must be one of: {valid}, got {quality}
ru: качество видео должно быть одним из: {valid}, получил {quality}
uk: якість відео має бути одним з: {valid}, отримав {quality}

source: [SKIP] Already exists: {title}
ru: [ПРОПУЩЕНО] Уже существует: {title}
uk: [ПРОПУЩЕНО] Вже існує: {title}

source: [START] {title}
ru: [ЗАПУСК] {title}
uk: [ПОЧАТОК] {title}

source: [DONE] {title}
ru: [ЗАКОНЧЕНО] {title}
uk: [ЗАВЕРШЕНО] {title}

source: Error closing resource: {error}
ru: Ошибка закрытия ресурса: {error}
uk: Помилка закриття ресурсу: {error}

source: Failed to extract info for {url}: {error}
ru: Ошибка при извлечении информации для {url}: {error}
uk: Помилка отримання інформації для {url}: {error}

source: Unable to extract video info
ru: Невозможно извлечь информацио о видео
uk: Неможливо отримати інформацію щодо відео

source: Download failed for {url}: {error}
ru: Загрузка не удалась для {url}: {error}
uk: Невдале завантаження {url}: {error}

source: DOWNLOAD SUMMARY:
ru: ИТОГ ЗАГРУЗКИ
uk: ПІДСУМОК ЗАВАНТАЖЕННЯ

source: Processed: {total}
ru: Обработано: {total}
uk: Опрацьовано: {total}

source: Successful: {success}
ru: Успешно: {success}
uk: Успішно: {success}

source: Skipped: {skipped}
ru: Пропушено: {skipped}
uk: Пропушено: {skipped}

source: Failed: {failed}
ru: Ошибки: {failed}
uk: Помилки: {failed}

source: Elapsed time: {elapsed:.2f}s
ru: Общее время: {elapsed:.2f}s
uk: Загальний час: {elapsed:.2f}s

source: No URLs to download.
ru: Нету адреса для загрузки.
uk: Немає адреси завантаження.

source: Starting download of {count} items with {workers} workers
ru: Начало загрузки {count} елементов в {workers} потоках
uk: НПочаток завантаження {count} елементів у {workers} потоках

source: Error: file '{file}' not found
ru: Ошибка: файл '{file}' не найдем
uk: Помилка: файл '{file}' не найдено

source: Error reading '{file}': {error}
ru: Ошибка чтения '{file}': {error}
uk: Помилка читання '{file}': {error}

source: Download interrupted by user.
ru: Загрузка прервана пользователем.
uk: Завантаження прервано користуачем.

source: Critical error: {error}
ru: Критическая ошибка: {error}
uk: Критичена помилка: {error}
